test/data/xml/hikvision/media/GetAudioDecoderConfigurations.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
  <s:Header>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security s:mustUnderstand="1">
      <wsu:Timestamp wsu:Id="Time">
        <wsu:Created>2018-02-24T17:26:58.121Z</wsu:Created>
        <wsu:Expires>2018-02-24T17:27:08.121Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:UsernameToken wsu:Id="User">
        <wsse:Username>admin</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">q3ejMdtQjBJSZHyKq2q/3VSoQkk=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">GvroqfsyNW8JSNLu+V+PFA==</wsse:Nonce>
        <wsu:Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-24T17:26:58.121Z
        </wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
  <s:Body>
    <trt:GetAudioDecoderConfigurations/>
  </s:Body>
</s:Envelope>